src/cf/Catalogs/узКонстанты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>узКонстанты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТЧЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛевоеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/узКонстанты/Ext/ManagerModule.bsl
Функция ПолучитьМассивЗначенийКонстанты(ИмяКонстанты,ТипКонстанты,РеквизитТЧЗначения = "ЛевоеЗначение",Отказ = Ложь, ВыдаватьСообщенияОбОшибках = Истина) Экспорт 
	МассивЗначенийКонстанты = Неопределено;
	
	пКонстанта = ПредопределенноеЗначение("Справочник.узКонстанты."+ИмяКонстанты);
	
	Если ТипЗнч(ТипКонстанты) = Тип("Строка") Тогда
		ТипКонстанты = Тип(ТипКонстанты);
	Конецесли;	
	
	пТЧЗначения = пКонстанта.ТЧЗначения;
	Если пТЧЗначения.Количество() = 0 Тогда
		Если ВыдаватьСообщенияОбОшибках Тогда
			Сообщить("Ошибка! Не заполнена ТЧЗначения """+ИмяКонстанты+""", в константах");
		КонецЕсли;
		Отказ = Истина;			
		Возврат МассивЗначенийКонстанты;	
	Иначе
		МассивЗначенийКонстанты = Новый Массив(); 
	Конецесли;
	
	МассивОшибок = Новый Массив();
	
	Для каждого СтрокаТЧЗначения из пТЧЗначения цикл
		мЗначениеКонстанты = СтрокаТЧЗначения[РеквизитТЧЗначения];		
		Если мЗначениеКонстанты = Неопределено 
			ИЛИ НЕ ЗначениеЗаполнено(мЗначениеКонстанты) Тогда
			МассивОшибок.Добавить("Ошибка! не заполнен элемент в ТЧЗначения """+ИмяКонстанты+""", в константах");
			Отказ = Истина;
			Продолжить;
		Конецесли;
		Если ТипЗнч(мЗначениеКонстанты) <> ТипКонстанты Тогда
			МассивОшибок.Добавить("Ошибка! указан неверный тип для элемента """+ИмяКонстанты+""", в константах"
				+" должен быть тип ["+ТипКонстанты+"]");
			Отказ = Истина;
			Продолжить;			
		Конецесли;
		МассивЗначенийКонстанты.Добавить(мЗначениеКонстанты);
	Конеццикла;
	
	Если НЕ ЗначениеЗаполнено(МассивЗначенийКонстанты) Тогда
		МассивОшибок.Добавить("Ошибка! Не заполнена ТЧЗначения """+ИмяКонстанты+""", в константах");
		Отказ = Истина;		
	Конецесли;
	
	Если ВыдаватьСообщенияОбОшибках Тогда
		Для каждого ЭлМассиваОшибок из МассивОшибок цикл
			Сообщить(ЭлМассиваОшибок);
		Конеццикла;	
	Конецесли;
	
	Возврат МассивЗначенийКонстанты;
КонецФункции
